/* Localizers: These values are used in the column headers and in the details pane for attribute titles */

/* all */
amazonProductGroup = "amazon product group";
asin = "amazon link";
associatedURL = "url";
audienceRecommendedAgeSingularString = "audience";
boxHeightInInches = "height";
boxLengthInInches = "length";
boxWeightInPounds = "weight";
boxWidthInInches = "width";
coverImageLargeURLString = "your image URL";
coverImageColorsCompositeString = "cover color";
creationDate = "creation date";
creatorsCompositeString = "creator";
creatorsCompositeString.Book = "author";
creatorsCompositeString.Movie = "director";
creatorsCompositeString.Music = "artist";
creatorsCompositeString.Software = "developer";
creatorsCompositeString.VideoGame = "studio";
creatorsCompositeString.Toy = "company";
creatorsCompositeString.Gadget = "manufacturer";
creatorsCompositeString.Tool = "manufacturer";
creatorsCompositeString.Apparel = "label";
creatorsCompositeString.iTunesAlbum = "artist";
creatorsCompositeString.iTunesAudiobook = "author";
creatorsCompositeString.iTunesMovie = "director";
creatorsCompositeString.iTunesShow = "creator";
creatorsCompositeString.iTunesBook = "author";
countryCode = "country";
currentValue = "current value";
ean = "EAN";
editionsCompositeString = "edition";
featuresCompositeString = "features";
formatSingularString = "format";
genresCompositeString = "genres";
key = "key";
languagesCompositeString = "languages";
lastLookupTime = "lookup time";
minimumPlayers = "minimum players";
maximumPlayers = "maximum players";
netRating = "net rating";
numberInSeries = "no. in series";
numberOfMedia = "no. of items";
price = "retail price";
publishDate = "release date";

publishersCompositeString = "publisher";
publishersCompositeString.Book = "publisher";
publishersCompositeString.Movie = "studio";
publishersCompositeString.Music = "label";
publishersCompositeString.Software = "company";
publishersCompositeString.VideoGame = "publisher";
publishersCompositeString.Toy = "company";
publishersCompositeString.Gadget = "sold by";
publishersCompositeString.Tool = "sold by";
publishersCompositeString.Apparel = "label";
publishersCompositeString.iTunesAlbum = "label";
publishersCompositeString.iTunesAudiobook = "publisher";
publishersCompositeString.iTunesMovie = "studio";
publishersCompositeString.iTunesShow = "network";
publishersCompositeString.iTunesBook = "publisher";

rare = "rare";
seriesSingularString = "series";
subtitle = "subtitle";

title = "title";
title.Book = "title";
title.Movie = "title";
title.Music = "album";
title.Software = "title";
title.VideoGame = "title";
title.Toy = "name";
title.Gadget = "name";
title.Tool = "name";
title.Apparel = "name";
title.iTunesAlbum = "album";
title.iTunesAudiobook = "title";
title.iTunesMovie = "title";
title.iTunesShow = "name";
title.iTunesBook = "title";

type = "item type";
uuidString = "unique item key";
widthLengthHeightString = "dimensions";

/* all - my info */
buyPrice = "purchase price";
conditionSingularString = "condition";

hasExperienced = "played / read";
hasExperienced.Book = "read";
hasExperienced.Movie = "watched";
hasExperienced.Music = "played";
hasExperienced.Software = "launched";
hasExperienced.VideoGame = "played";
hasExperienced.Toy = "played";
hasExperienced.Gadget = "played";
hasExperienced.Tool = "played";
hasExperienced.Apparel = "worn";
hasExperienced.iTunesAlbum = "played";
hasExperienced.iTunesAudiobook = "played";
hasExperienced.iTunesMovie = "watched";
hasExperienced.iTunesShow = "watched";
hasExperienced.iTunesBook = "read";

isSigned = "signed";
locationSingularString = "location";
containingShelfTitlesCompositeString = "shelves";
notes = "notes";
ownerSingularString = "owner";
privateCollection = "private";
purchaseDate = "purchase date";
rating = "rating";
used = "used";

/* books */
deweyDecimal = "dewey decimal";
illustratorsCompositeString = "illustrator";
isbn = "ISBN";
libraryOfCongressCallNumber = "library of congress";
pages = "pages";

/* movies */
actorsCompositeString = "stars";
cinematographersCompositeString = "cinematographer";
minutes = "running time"; /* also music */

screenwritersCompositeString = "screenwriter";
theatricalDate = "theatrical debut";

/* music */
composersCompositeString = "composer";
conductorsCompositeString = "conductor";
tracksCompositeString = "tracks";
minutes.Music = "time"; /* also movies */

/* games */
platformsCompositeString = "platform";
players = "players";

/* software | electronics - my info  */
serialNumber = "serial number";

/* loans */
"loan.borrower.fullName" = "lent to";
"loan.dueDate" = "due date";
"loan.daysOverdue" = "days overdue";
"loan.notes" = "loan notes";
"loan.remindBeforeDays" = "reminder";

/* virtual, used for smart shelves */
"amazonSynopses" = "synopsis";
"userSynopsis" = "your synopsis";

/* virtual, used for search field */
primaryDescriptionAttributedString = "primary synopsis";
"primaryDescriptionString" = "primary synopsis";

/* virtual, used for undo */
"userSynopsisAttributedString" = "synopsis";
